clear
clc
a=[20.55 22.44 25.37 27.13 29.45 30.10 30.96 34.06 36.42 38.09 39.13 39.99 41.93 44.59 47.30 52.89 55.73 56.76 59.17 60.63];
b=[0.6 0.75 0.85 0.9 1.05 1.35 1.45 1.6 1.7 1.85 2.15 2.2 2.25 2.35 2.5 2.6 2.7 2.85 2.95 3.1];
c=[0.09 0.11 0.11 0.14 0.20 0.23 0.23 0.32 0.32 0.34 0.36 0.36 0.38 0.49 0.56 0.59 0.59 0.67 0.69 0.79];
d=[5126 6217 7730 9145 10460 11387 12353 15750 18304 19836 21024 19490 20433 22598 25107 33442 36836 40548 42927 43462];
e=[1237 1379 1385 1399 1663 1714 1834 4322 8132 8936 11099 11203 10524 11115 13320 16762 18673 20724 20803 21804]; %原始数据
p=[a;b;c];%输入数据矩阵
t=[d;e];%目标数据矩阵
[pp,ps1] = mapminmax(p,-1,1);
[tt,ps2] = mapminmax(t,-1,1);
net=feedforwardnet(7);
net.trainParam.show=1000;
net.trainParam.lr=0.05;%学习速度为0.05
net.trainParam.epochs=50000;%最大训练轮回为50000次
net.trainParam.goal=0.35*10^(-3);%均方误差
net=train(net,pp,tt);%开始训练，
ss=net(pp);
sss=mapminmax('reverse',ss,ps2);
net.performFcn
perf=perform(net,ss,tt) % 计算误差性能